///////////////////////////////////////////////////////////////////
//
// ADT Mergeable Priority Queue
//
// Abstract ουρά προτεραιότητας με δυνατότητα συγχώνευσης (merge).
// Σε κάθε remove αφαιρείται το μεγαλύτερο στοιχείο (με βάση τη
// συνάρτηση compare).
//
///////////////////////////////////////////////////////////////////

#pragma once // #include το πολύ μία φορά

#include "common_types.h"
#include "ADTVector.h"


// Μία ουρά προτεραιότητας με συγχώνευση αναπαριστάται από τον τύπο MPQ

typedef struct mpq* MPQ;


// Δημιουργεί και επιστρέφει μια νέα κενή ουρά προτεραιότητας, της οποίας τα στοιχεία συγκρίνονται με βάση τη συνάρτηση compare.
// Αν destroy_value != NULL, τότε καλείται destroy_value(value) κάθε φορά που αφαιρείται ένα στοιχείο.

MPQ mpq_create(CompareFunc compare, DestroyFunc destroy_value);

// Επιστρέφει τον αριθμό στοιχείων που περιέχει η ουρά mpq

int mpq_size(MPQ mpq);

// Επιστρέφει το μεγαλύτερο στοιχείο της ουράς (μη ορισμένο αποτέλεσμα αν η ουρά είναι κενή)

Pointer mpq_max(MPQ mpq);

// Προσθέτει την τιμή value στην ουρά mpq.

void mpq_insert(MPQ mpq, Pointer value);

// Αφαιρεί την μεγαλύτερη τιμή της ουράς (μη ορισμένο αποτέλεσμα αν η ουρά είναι κενή)

void mpq_remove_max(MPQ mpq);

// Συγχωνεύει την ουρά mpq2 στην ουρά mpq. Μετά την κλήση η mpq περιέχει το σύνολο των στοιχείων των
// δύο ουρών, ενώ η mpq2 έχει καταστραφεί (η χρήση της μετά το merge είναι μη ορισμένη). Η συγχώνευση
// απαιτεί η διάταξη και η συνάρτηση destroy των δύο ουρών να είναι η ίδια (διαφορετικά η συμπεριφορά
// είναι μη ορισμένη).

void mpq_merge(MPQ mpq, MPQ mpq2);

// Αλλάζει τη συνάρτηση που καλείται σε κάθε αφαίρεση/αντικατάσταση στοιχείου σε
// destroy_value. Επιστρέφει την προηγούμενη τιμή της συνάρτησης.

DestroyFunc mpq_set_destroy_value(MPQ mpq, DestroyFunc destroy_value);

// Ελευθερώνει όλη τη μνήμη που δεσμεύει η ουρά mpq.
// Οποιαδήποτε λειτουργία πάνω στη ουρά μετά το destroy είναι μη ορισμένη.

void mpq_destroy(MPQ mpq);
